<link rel="import" href="../../bower_components/polymer/polymer.html">

<link rel="import" href="../../bower_components/iron-flex-layout/iron-flex-layout-classes.html">

<link rel="import" href="../utils/paper-card-ripple.html">
<link rel="import" href="../utils/scroll-to.html">
<link rel="import" href="../utils/title-collapse.html">

<link rel="import" href="../shared-styles.html">

<dom-module id="orca-employees">
    <template>
        <style is="custom-style" include="shared-styles iron-flex iron-flex-alignment">
        :host {
            display: block;
        }
        </style>

        <div class="layout vertical">
            <paper-card-ripple id="overview" heading="Vue d'ensemble">
                <div class="card-content">
                    <h1>Introduction</h1>
                    <p>
                        Les <em>agents</em> correspondent aux ressources humaines employ&eacute;es par votre organisation. Ils sont affect&eacute;s &agrave; des <a href="/orca-sites">sites</a> et participent &agrave; des <a href="/orca-trainings">formations</a>.
                    </p>
                    <p>
                        Les <em>agents</em> sont les entit&eacute;s de base pour lesquelles des statistiques sont &eacute;tablies. Les statistiques des <a href="/orca-sites">sites</a> et
                        <a href="/orca-departments">d&eacute;partements</a> sont obtenues &agrave; partir de celles des agents, chacun d'entre eux comptant essentiellement soit parmi l'effectif ayant actuellement une certaine aptitude, soit parmi celui ne l'ayant pas.
                        <br />Afin d'exploiter plus pr&eacute;cis&eacute;ment les donn&eacute;es, on pourra distinguer cependant les agents n'ayant jamais &eacute;t&eacute; form&eacute;s de ceux dont la formation est &agrave; renouveler&nbsp;; de m&ecirc;me que les aptitudes <em>valides</em> se d&eacute;clinent en deux groupes, selon qu'elles expirent bient&ocirc;t ou non.
                    </p>
                    <p>
                        Un compte <a href="/admin-users">utilisateur</a> peut &ecirc;tre li&eacute; et attribu&eacute; &agrave; un <em>agent</em>.
                    </p>
                    <h1>Pr&eacute;sentation</h1>
                    <p>
                        Comme chaque <em>module de visualisation</em>, la pr&eacute;sentation des agents se compose de deux pages&nbsp;: celle de <em>listage</em>, et la <em>fiche agent</em>.
                    </p>

                    <title-collapse id="listing-page" h2>
                        <span class="title">Page de listage</span>
                        <p>
                            Cette page se compose principalement d'un tableau de l'ensemble des agents <a href="/access">accessibles</a> &agrave; l'utilisateur. Elle int&egrave;gre les fonctionnalit&eacute;s de <a href="/orca-advanced-search">recherche avanc&eacute;e</a>, de <a href="/links">partage</a> et d'<a href="/exports">export</a>. On y retrouve, pour chaque agent, ses&nbsp;:
                        </p>
                        <ol type="I">
                            <li>identifiant</li>
                            <li>civilit&eacute;</li>
                            <li>nom</li>
                            <li>pr&eacute;nom</li>
                            <li>site d'affectation</li>
                            <li>statut (<span class="label label-success">CDI</span> ou <span class="label label-warning">CDD</span>)</li>
                        </ol>
                        <p>
                            Ansi que, pour chaque <a href="/orca-observed-certificates">aptitude observ&eacute;e</a>&nbsp;: la date limite de validit&eacute;. Celle-ci utilise &eacute;galement un <em>code couleur</em> permettant d'un simple coup d'&oelig;il de savoir qu'elle est soit&nbsp;:
                        </p>
                        <ol type="I">
                            <li><span class="label label-success">vert</span>&nbsp;: actuellement valide</li>
                            <li><span class="label label-warning">orange</span>&nbsp;: valide, expirant sous 6 mois</li>
                            <li><span class="label label-danger">rouge</span>&nbsp;: expir&eacute;e (ou autrement invalid&eacute;e)</li>
                        </ol>
                        <p>
                            L'absence de badge d&eacute;note une aptitude <em>jamais acquise</em>.
                        </p>
                        <scroll-to target="#certificates">Aptitudes d'un agent</scroll-to>
                    </title-collapse>

                    <title-collapse id="employee-page" h2>
                        <span class="title">Fiche agent</span>
                        <p>
                            La fiche d'un agent se compose des deux &eacute;l&eacute;ments que sont son <em>tableau de bord</em> et la liste de ses <a href="/orca-trainings">formations</a>.
                        </p>
                        <h3 class="layout horizontal center">Barre d'actions<hr class="flex" /></h3>
                        <p>
                            La <a href="actions">barre d'action</a> sur cette page propose aux utilisateurs ayant les privil&egrave;ges n&eacute;cessaires&nbsp;:
                        </p>
                        <ol type="I">
                            <li>la prise de notes &agrave; faire appara&icirc;tre dans le tableau de bord de l'agent</li>
                            <li>
                                la gestion de <em>sortie des dispositifs</em>, pour le cas o&ucirc; une aptitude particuli&egrave;re est amen&eacute;e &agrave; &ecirc;tre invalid&eacute;e imm&eacute;diatement et ind&eacute;finiment.
                            </li>
                        </ol>
                        <scroll-to target="/admin-users#roles">Gestion des utilisateurs &mdash; R&ocirc;les utilisateur</scroll-to>
                        <h3 class="layout horizontal center">Tableau de bord<hr class="flex" /></h3>
                        <p>
                            Le tableau de bord concentre l'int&eacute;gralit&eacute; des informations de l'agent&nbsp;:
                        </p>
                        <ol type="I">
                            <li>son type de contrat</li>
                            <li>son site d'affectation</li>
                            <li>sa date de naissance</li>
                            <li>son adresse courriel si renseign&eacute;e</li>
                            <li>les &eacute;ventuelles notes prises le concernant</li>
                            <li>les &eacute;ventuelles invalidations de ses aptitudes, d&eacute;taill&eacute;es avec les date effective et raison d'invalidation</li>
                        </ol>
                        <p>
                            Puis, pour chaque <a href="/orca-observed-certificates">aptitude observ&eacute;e</a>&nbsp;:
                        </p>
                        <ol type="I">
                            <li>sa date limite de validit&eacute;</li>
                            <li>la dur&eacute;e restante pour en pr&eacute;voir le renouvellement</li>
                        </ol>
                        <p>
                            Ces informations utilisent un <em>code couleur</em> selon que l'aptitude correspondante est&nbsp;:
                        </p>
                        <ol type="I">
                            <li><span class="label label-success">vert</span>&nbsp;: actuellement valide</li>
                            <li><span class="label label-warning">orange</span>&nbsp;: valide, expirant sous 6 mois</li>
                            <li><span class="label label-danger">rouge</span>&nbsp;: expir&eacute;e (ou autrement invalid&eacute;e)</li>
                        </ol>
                        <p>
                            L'absence d'information d&eacute;note une aptitude <em>jamais acquise</em>.
                        </p>
                        <scroll-to target="#certificates">Aptitudes d'un agent</scroll-to>
                        <h3 class="layout horizontal center">Liste des formations<hr class="flex" /></h3>
                        <p>
                            La liste des <a href="/orca-trainings">formations</a> auxquelles un agent a particip&eacute; pr&eacute;sente certaines informations pour chacune d'entre elles&nbsp;:
                        </p>
                        <ol type="I">
                            <li>le type de formation &mdash; avec les badges des diff&eacute;rentes <em>aptitudes</em> associ&eacute;s</li>
                            <li>la/les date(s) de formation</li>
                            <li>une observation &eacute;ventuelle du formateur concernant l'agent</li>
                            <li>le statut de validation de la formation pour l'agent</li>
                        </ol>
                        <p>
                            Chaque formation list&eacute;e utilise un <em>code couleur</em> pour les badges d'<em>aptitudes octroy&eacute;es</em> et de <em>statut de validation</em> comme suit&nbsp;:
                        </p>
                        <ol type="I">
                            <li><span class="label label-success">vert</span>&nbsp;: agent valid&eacute;, aptitude(s) acquise(s)/renouvel&eacute;e(s)</li>
                            <li><span class="label label-danger">rouge</span>&nbsp;: agent recal&eacute;/absent, aptitude(s) non acquise(s)/non renouvel&eacute;e(s)</li>
                            <li><span class="label label-blank">gris</span>&nbsp;:
                                <abbr class="initialism" title="Proc&egrave;s Verbal">PV</abbr> de formation non dress&eacute;
                            </li>
                        </ol>
                        <p>
                            La <a href="/orca-advanced-search">recherche avanc&eacute;e</a> n'est pas disponible pour cette liste. Cliquer sur l'une de ces formations ouvre la fiche de celle-ci.
                        </p>
                    </title-collapse>
                </div>
            </paper-card-ripple>

            <paper-card-ripple id="certificates" heading="Aptitudes d'un agent">
                <div class="card-content">
                    <p>
                        Les <a href="/admin-certificates">aptitudes</a> d'un agent sont les propri&eacute;t&eacute;s auxquelles s'int&eacute;ressent les statistiques. Elles sont obtenues en participant &agrave; une formation et &eacute;tant valid&eacute; &agrave; l'issue de celle-ci et peuvent &ecirc;tre perdues de diff&eacute;rentes mani&egrave;res.
                    </p>
                    <p>
                        De fa&ccedil;on g&eacute;n&eacute;nale, les aptitudes des agents sont soit <em>valides</em>, soit <em>invalides</em>. N&eacute;anmoins, on distingue en r&eacute;alit&eacute; quatre diff&eacute;rents &eacute;tats de validit&eacute;, chacun identifi&eacute; facilement &agrave; l'aide du <em>code couleur</em> suivant&nbsp;:
                    </p>
                    <ol type="I">
                        <li><span class="label label-success">vert</span>&nbsp;: l'aptitude est valide et le sera encore pour longtemps</li>
                        <li><span class="label label-warning">orange</span>&nbsp;: l'aptitude est valide mais devra &ecirc;tre renouvel&eacute;e sous 6 mois</li>
                        <li><span class="label label-danger">rouge</span>&nbsp;: l'aptitude a expir&eacute; (ou a &eacute;t&eacute; autrement express&eacute;ment invalid&eacute;e)</li>
                        <li><span class="label label-blank">gris</span>&nbsp;: l'aptitude n'a jamais &eacute;t&eacute; acquise</li>
                    </ol>
                    <h1>Acquisition et renouvellement</h1>
                    <p>
                        Les aptitudes sont acquises par les agents selon leur participation aux <a href="/orca-trainings">formations</a>. Chaque formation est d'un type particulier, auquel des aptitudes sont associ&eacute;es (voir <a href="/admin-certificates">gestion des aptitudes</a>).
                    </p>
                    <p>
                        &Agrave; l'issue d'une formation, lorsque le formateur dresse le
                        <abbr class="initialism" title="Proc&egrave;s Verbal">PV</abbr> de fin de session, les agents qu'il valide acqui&egrave;rent l'int&eacute;gralit&eacute; des aptitudes octroy&eacute;es par les formations de ce type.
                        <br />Les absences et autres raisons pour non-validation sont sans cons&eacute;quence.
                    </p>
                    <h1>Perte et expiration</h1>
                    <p>
                        Sans &ecirc;tre renouvel&eacute;es, les aptitudes acquises expirent selon les dur&eacute;es configur&eacute;es dans la <a href="/admin-certificates">gestion des aptitudes</a>.
                    </p>
                    <p>
                        Il est n&eacute;anmoins &eacute;galement possible d'invalider explicitement les aptitudes de certains agents directement depuis leur fiche personnelle, en r&eacute;ponse &agrave; une demande de ces derniers par exemple. Les agents ainsi <em>exclus d'un dispositif</em> ne peuvent plus acqu&eacute;rir l'aptitude correspondante &agrave; moins d'&ecirc;tre r&eacute;int&eacute;gr&eacute; de la m&ecirc;me mani&egrave;re.
                    </p>
                </div>
            </paper-card-ripple>
        </div>
    </template>

    <script>
    Polymer({
        is: 'orca-employees'
    });
    </script>
</dom-module>
