<link rel="import" href="../../bower_components/polymer/polymer.html">

<link rel="import" href="../../bower_components/iron-flex-layout/iron-flex-layout-classes.html">

<link rel="import" href="../../bower_components/paper-video/paper-video.html">

<link rel="import" href="../utils/paper-card-ripple.html">
<link rel="import" href="../utils/title-collapse.html">

<link rel="import" href="../shared-styles.html">

<dom-module id="orca-quick-search">
    <template>
        <style is="custom-style" include="shared-styles iron-flex iron-flex-alignment">
        :host {
            display: block;
        }
        </style>

        <div class="layout vertical">
            <paper-card-ripple id="overview" heading="Vue d'ensemble">
                <div class="card-content">
                    <h1>Introduction</h1>
                    <p>
                        La <em>recherche globale</em> (ou <em>recherche rapide</em>) est un module d'acc&egrave;s rapide aux ressources.
                        <br />Il s'agit simplement d'un champ de saisie int&eacute;gr&eacute; au bandeau-menu principal. Commencer &agrave; y saisir une recherche d&eacute;roule un menu pr&eacute;sentant les ressources correspondantes, mises en valeur selon leur pertinence.
                    </p>
                    <h2>D&eacute;tails d'impl&eacute;mentation</h2>
                    <ol type="I">
                        <li>Seuls les <em>modules de visualisation</em> sont interfac&eacute;s &agrave; travers cette fonctionnalit&eacute; d'acc&egrave;s rapide.</li>
                        <li>Cliquer sur une entr&eacute;e de ce menu permet d'acc&eacute;der &agrave; la page de la ressource associ&eacute;e.</li>
                        <li>
                            Le menu est &eacute;galement navigable sans lever les mains du clavier, &agrave; l'aide des touches directionnelles. La touche
                            <kbd>Entr&eacute;e&nbsp;&crarr;</kbd> s&eacute;lectionne l'item focalis&eacute; et ouvre la fiche correspondante.
                        </li>
                    </ol>
                    <p>
                        Dans la vid&eacute;o de d&eacute;monstration ci-dessous, l'utilisateur acc&egrave;de &agrave; plusieurs fiches <a href="/orca-sites">sites</a>, <a href="/orca-employees">agents</a> et <a href="/orca-trainings">formations</a> &agrave; l'aide de la recherche globale.
                    </p>
                </div>
                <div class="img border-top">
                    <paper-video controls preload="auto" src="../../assets/orca-quick-search/overview.webm" autohide-controls="500" height="600"></paper-video>
                </div>
            </paper-card-ripple>

            <paper-card-ripple id="filtering-sorting" heading="Filtrage et tri">
                <div class="card-content">
                    <p>
                        La <em>recherche globale</em> se d&eacute;compose en une fonction de filtrage et l'application d'un algorithme de tri.
                        <br />Cette section d&eacute;crit le d&eacute;tail technique du fonctionnement de la recherche globale&nbsp;: les informations suivantes sont complexes et largement inint&eacute;ressantes.
                    </p>
                    <title-collapse id="filtering" h2>
                        <span class="title">S&eacute;lection des ressources</span>
                        <p>
                            Les quatre types de ressources constituant l'ensemble des <em>modules de visualisation</em> sont accessibles via cette fonctionnalit&eacute;. Celles-ci sont identifi&eacute;es et s&eacute;lectionn&eacute;es selon leur type. Ainsi&nbsp;:
                            <ol type="I">
                                <li>la s&eacute;lection des <a href="/orca-departments">d&eacute;partements</a> et <a href="/orca-sites">sites</a> utilise leurs noms</li>
                                <li>la s&eacute;lection des <a href="/orca-employees">agents</a> peut se faire par leur identifiant, site, nom et pr&eacute;nom</li>
                                <li>la s&eacute;lection des <a href="/orca-trainings">formations</a> utilise leurs types et leurs dates</li>
                            </ol>
                        </p>
                    </title-collapse>
                    <title-collapse id="sorting" h2>
                        <span class="title">Ordonnancement des r&eacute;sultats</span>
                        <p>
                            Les r&eacute;sultats, potentiellement nombreux, sont soumis &agrave; un algorithme de prioritisation qui permet de sugg&eacute;rer &agrave; l'utilisateur les plus pertinents d'abord. Cet algorithme se d&eacute;compose en trois niveaux&nbsp;:
                        </p>
                        <ul>
                            <li>
                                Les ressources qui correspondent au crit&egrave;re de recherche sont pr&eacute;sent&eacute;es selon leur type&nbsp;:
                                <ol type="I">
                                    <li>les <a href="/orca-departments">d&eacute;partements</a> puis les <a href="/orca-sites">sites</a> en priorit&eacute;</li>
                                    <li>les <a href="/orca-employees">agents</a> dans un second temps</li>
                                    <li>les <a href="/orca-trainings">formations en dernier</a></li>
                                </ol>
                            </li>
                            <li>
                                Selon leur type, les ressources sont ensuite pr&eacute;sent&eacute;s dans un ordre sp&eacute;cifique&nbsp;:
                                <ul>
                                    <li>les <a href="/orca-departments">d&eacute;partements</a> et <a href="/orca-sites">sites</a> sont tri&eacute;s par ordre alphanum&eacute;rique</li>
                                    <li>les <a href="/orca-trainings">formations</a> sont tri&eacute;es par ordre chronologique d&eacute;croissant&nbsp;: les plus r&eacute;centes d'abord</li>
                                    <li>les agents, ayant statistiquement nettement davantage de correspondances, sont sujets &agrave; un algorithme de prioritisation plus complexe d&eacute;crit ci-apr&egrave;s
                                    </li>
                                </ul>
                            </li>
                            <li>
                                Les agents sont prioritis&eacute;s si leur <em>nom de famille</em> correspond au premier mot entr&eacute; dans le champ de recherche. Puis, &agrave; un m&ecirc;me niveau de priorit&eacute;, les agents sont ensuite class&eacute;s par ordre alphab&eacute;tique du nom de famille, puis du pr&eacute;nom. Ainsi, chercher <span class="quote">NICOLAS</span> proposera, dans l'ordre suivant&nbsp;:
                                <ol type="I">
                                    <li>NICOLAS Eric</li>
                                    <li>NICOLAS Fran&ccedil;ois</li>
                                    <li>ALLARD Nicolas</li>
                                    <li>BARON Nicolas</li>
                                    <li>...</li>
                                </ol>
                            </li>
                        </ul>
                    </title-collapse>
                </div>
            </paper-card-ripple>
        </div>
    </template>
    <script>
    Polymer({
        is: 'orca-quick-search'
    });
    </script>
</dom-module>
